In [561]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LogisticRegression
import matplotlib.pyplot as plt

In [562]:
df = pd.read_csv('titanic_full.csv')
df

      Pclass      Fare  Survived
0          3    7.2500         0
1          1   71.2833         1
2          3    7.9250         1
3          1   53.1000         1
4          3    8.0500         0
...      ...       ...       ...
1303       3    8.0500         0
1304       1  108.9000         1
1305       3    7.2500         0
1306       3    8.0500         0
1307       3   22.3583         0

[1308 rows x 3 columns]

In [563]:
x = df[['Pclass', 'Fare']]
x

      Pclass      Fare
0          3    7.2500
1          1   71.2833
2          3    7.9250
3          1   53.1000
4          3    8.0500
...      ...       ...
1303       3    8.0500
1304       1  108.9000
1305       3    7.2500
1306       3    8.0500
1307       3   22.3583

[1308 rows x 2 columns]

In [564]:
y = df['Survived']
y

0       0
1       1
2       1
3       1
4       0
       ..
1303    0
1304    1
1305    0
1306    0
1307    0
Name: Survived, Length: 1308, dtype: int64

In [565]:
from sklearn.model_selection import train_test_split

In [577]:
x_train, x_test, y_train, y_test= train_test_split(x, y, test_size=0.25, random_state= 50)

In [578]:
x_train

      Pclass      Fare
450        2   27.7500
1016       3   16.1000
318        1  164.8667
286        3    9.5000
1265       1  262.3750
...      ...       ...
1305       3    7.2500
229        3   25.4667
70         2   10.5000
132        3   14.5000
109        3   24.1500

[981 rows x 2 columns]

In [579]:
x_test

      Pclass      Fare
160        3   16.1000
1083       2   12.3500
25         3   31.3875
195        1  146.5208
349        3    8.6625
...      ...       ...
842        1   31.0000
19         3    7.2250
474        3    9.8375
1283       2   10.5000
344        2   13.0000

[327 rows x 2 columns]

In [580]:
y_train

450     0
1016    1
318     1
286     1
1265    1
       ..
1305    0
229     0
70      0
132     0
109     1
Name: Survived, Length: 981, dtype: int64

In [581]:
y_test

160     0
1083    0
25      1
195     1
349     0
       ..
842     1
19      1
474     0
1283    0
344     0
Name: Survived, Length: 327, dtype: int64

In [582]:
log= LogisticRegression()

In [583]:
log.fit(x_train, y_train)

LogisticRegression()

In [584]:
y_predicted= log.predict(x_test)

In [585]:
log.score(x_test, y_test)

0.7125382262996942